app/Controllers/ProductoController.php

    public function index() {
        $productos = $this->productoModel->findAll();
---
SELECT *
FROM `productos`

    public function edit($id) {
        $producto = $this->productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'

    public function delete($id) {
        $this->productoModel->delete($id);
---
DELETE FROM `productos`
WHERE `id` IN ('7')

    public function show($id) {
        $producto = $this->productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'