app/Controllers/ProductoController.php

      public function show($id) {
        $producto = $this->productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'